def calculate_gravitational_force(m1, m2, r):
    G = 6.67430 * 10**-11
    force = G * (m1 * m2) / r**2
    return force

masses = {
    'Меркурий': 3.3011 * 10**23,
    'Венера': 4.8675 * 10**24,
    'Земля': 5.97237 * 10**24,
    'Марс': 6.4171 * 10**23,
    'Юпитер': 1.8982 * 10**27,
    'Сатурн': 5.6834 * 10**26,
    'Уран': 8.6810 * 10**25,
    'Нептун': 1.02413 * 10**26
}

distances = {
    'Меркурий': 7.6 * 10**7,
    'Венера': 4.2 * 10**7,
    'Марс': 7.8 * 10**7,
    'Юпитер': 6.2 * 10**8,
    'Сатурн': 1.2 * 10**9,
    'Уран': 2.6 * 10**9,
    'Нептун': 4.3 * 10**9
}

for planet in masses:
    force = calculate_gravitational_force(masses['Земля'], masses[planet], masses[planet])
    print(f"Притяжение между Землей и {planet}: {force} Н")